{
  "name": "Joshua Gisiger",
  "logo_name": "joshua-gisiger",
  "role": "Software Engineer",
  "about": {
    "sections": {
      "personal-info": {
        "title": "personal-info",
        "icon": "icons/info-personal.svg",
        "info": {
          "bio": {
            "title": "bio",
            "files": {
              "bio": {
                "id": "1",
                "description": "<br> Hi Y'all, my name is Joshua Emiliano Nicolas Romo Gisiger Gonzalez. Yes... that's my full legal name. I was born and raised in Switzerland in a Mexican family, and moved to New York City at age 11 without knowing a word of English. <br><br> I'm now pursuing a B.S. in Computer Science with a Data Science minor at Rice University, and could not have been more grateful for every moment that has brought me to this point in my life. <br><br> I am deeply interested in the disruptions AI is causing and in building the systems and models that make AI so powerful and beneficial to humanity. Because with great power comes great responsibility."
              }
            }
          },
          "education": {
            "title": "education",
            "files": {
              "university": {
                "id": "1",
                "description": "<br>I am pursuing a B.S. in Computer Science with a minor in Data Science at Rice University.<br><br>I have a 3.87 GPA and have been repeatedly recognized on the President's Honor Roll for academic excellence.<br><br> My relevant coursework include: Intro to Computer Systems, Concurrent Program Design, Intro to Computer Vision, Tools & Models for Data Science, Linear Algebra, Probability & Statistics, Computer Ethics, (and more).<br><br>I currently serve as Vice President of Tech Solutions for ACT Rice, and previously led a 38-person team as System Architect on a product delivery for SLB. I also served as RHA lead for my residential college (McMurtry) and volunteer as an ESL tutor for Rice Housing and Dining staff."
              }
            }
          }
        }
      },
      "professional-info": {
        "title": "professional-info",
        "icon": "icons/info-professional.svg",
        "info": {
          "experience": {
            "title": "experience",
            "files": {
              "experience": {
                "id": "1",
                "description": "<br>Over my career in computer science, I've developed a strong foundation in software engineering through hands-on experience across industries such as artificial intelligence, finance, and medical technology. I've worked in both startup and corporate environments, contributing to projects involving AI tooling, large-scale systems integration, and real-time data processing.<br><br>My work spans full-stack development, machine learning, and system design, often in fast-paced, high-impact settings. I’m comfortable navigating complex codebases, collaborating across teams, and quickly adapting to new technologies. Across every role, I focus on building reliable, efficient, and meaningful solutions that drive real-world value."
              },
              "dust": {
                "id": "2",
                "year": "2025",
                "title": "Dust",
                "description": "In the summer of 2025 I completed an internship at Dust, an AI startup based in Paris, France that is focused on allowing users to create custom AI agents and connect them to their company files through various tools and integrations to automate and enhance workflows.<br><br> Throughout my summer I was embedded in the agile and fast paced development cycle typical of many early-stage startups. During my internship I authored 45+ merged PRs, contributing to developer tooling, security enhancements, platform refactors, customer-reported errors, and performance/stability improvements across Dust's production codebase.<br><br> My key accomplishments include: <br>- designing and building a Claude Code like CLI with an appealing UI for our client-facing platform, which when started created a client-side MCP server, supporting optimized file read/edit operations, concurrent file handling, content and filename search (glob/grep), and shell command execution. <br>- spearheading delivery of a contract-critical integration for an external partner, coordinating directly with stakeholders and owning implementation.<br>- researching and resolving security vulnerabilities, including prompt injection risks and unsafe image rendering paths.<br>- debugging production issues and implementing several utility features to enhance team workflows and code maintainability."
              },
              "libremax-capital": {
                "id": "3",
                "year": "2024",
                "title": "Libremax Capital",
                "description": "<br>In the summer of 2024 I completed an internship at Libremax Capital, where I worked on developing AI and machine learning solutions to enhance the firm's data processing and analysis capabilities.<br><br> Throughout my internship I worked on projects that required both technical implementation and strategic thinking about how AI could be applied to financial data processing. During my time there I focused on building secure, high-performance systems that could handle sensitive financial information while delivering accurate analytical insights.<br><br> My key accomplishments include: <br>- researching and implementing a fully local Retrieval-Augmented Generation (RAG) system that enabled secure and private document query handling with LLM responses, ensuring all sensitive hedge fund data remained on-premises.<br>- restructuring data flow and processing pipelines using Spacy's NLP capabilities to support multiprocessing, which allowed the team to train 5 models simultaneously instead of sequentially, making the training process up to 5 times faster without any loss in quality.<br>- debugging and optimizing existing codebase using dynamic programming, modular programming, and algorithm optimization techniques to improve efficiency and correct semantic issues.<br>- developing quick data retrieval programs and utilities that provided clean, immediate access to financial datasets for analysis and decision-making."
              },
              "brainlab": {
                "id": "4",
                "year": "2023",
                "title": "Brainlab",
                "description": "<br>In the summer of 2023 I completed an internship at Brainlab, a medical technology company based in Munich, Germany that develops software and hardware solutions for surgery and medical imaging to improve patient outcomes and surgical precision.<br><br> Throughout my internship I worked on cutting-edge computer vision projects that directly supported surgical applications. During my time there I focused on developing and optimizing object detection models that needed to meet the strict accuracy and performance requirements of medical technology.<br><br> My key accomplishments include: <br>- researching and implementing object detection models using TensorFlow API and YOLO, systematically evaluating a wide range of pre-trained models to determine optimal performance with our medical imaging datasets.<br>- training and optimizing an object detection model that achieved near 90% mAP (mean Average Precision) with an average inference time of around 20 milliseconds, meeting the real-time performance requirements for surgical applications.<br>- learning and working with specialized medical technology platforms including Brainlab's Kick 2 and Image Viewer software, as well as Magic Leap's AR headsets (Magic Leap 1 and 2) for surgical visualization.<br>- contributing to the software development lifecycle through coding, debugging, and testing while collaborating with cross-functional teams including developers, designers, and product managers to deliver medical-grade software solutions."
              }
            }
          }
        }
      },
      "hobbies-info": {
        "title": "hobbies-info",
        "icon": "icons/info-hobbies.svg",
        "info": {
          "tech-curiosity": {
            "title": "tech-curiosity",
            "files": {
              "tech-curiosity": {
                "id": 1,
                "description": "<br>I like to consume cool knowledge and stories around tech.<br><br>This is going to sound super weird and fake, but I really like reading about design patterns and code structure.<br><br>Learning what ways of thinking are appropriate to what types of problems, and how to shift one's approach to a certain mindset.<br><br>There's nothing that brings me quite as much peace as an elegant solution to a difficult problem.<br><br>I've read classics like the Gang of Four's <em>Design Patterns</em> and Uncle Bob's, now controversial, <em>Clean Code</em> and <em>Clean Architecture</em>.<br><br>I also love reading about the history of technology and its consequential developments.<br><br>Current favorites are <em>Deep Future</em> by Pablos Holman and <em>The Innovators</em> by Walter Isaacson.",
                "images": [
                  {
                    "title": "Design Patterns",
                    "src": "/images/hobbies/design-patterns.jpg"
                  },
                  {
                    "title": "The Innovators",
                    "src": "/images/hobbies/the-innovators.png"
                  }
                ]
              }
            }
          },
          "art-history": {
            "title": "art-history",
            "files": {
              "art-history": {
                "id": "1",
                "description": "<br>I’m a computer scientist at heart, but I’ve found a real passion for art history during my time at university. I’m especially fascinated by the dramatic shift from the detailed realism and grandeur of historical art between the 1500s and 1800s to the more experimental, abstract, and conceptually driven movements of the 1850s to the mid-20th century. I’ve taken several courses, including ones on Global Modernism, exploring how art and architecture across continents reflect tensions between tradition and modernity, and the Baroque Masters, including Rembrandt, Caravaggio, Velázquez, and others. What draws me in is how visual language evolves to reflect broader cultural and philosophical changes—how meaning can be expressed with as much power in abstraction as in realism.<br><br>Whether it's studying a Rembrandt chiaroscuro or the visual fragmentation of modernist architecture, art history gives me a different lens for thinking about structure, symbolism, and creativity.",
                "images": [
                  {
                    "title": "Consequences of War (Peter Paul Rubens)",
                    "src": "/images/hobbies/consequences-of-war.jpg",
                    "wide": true
                  },
                  {
                    "title": "Guernica (Pablo Picasso)",
                    "src": "/images/hobbies/guernica.jpg",
                    "wide": true
                  }
                ]
              }
            }
          }
        }
      }
    }
  },
  "contacts": {
    "direct": {
      "title": "contacts",
      "sources": {
        "email": "jg121@rice.edu",
        "phone": "+1 (929) 386 8521"
      }
    },
    "social": {
      "github": {
        "title": "Github profile",
        "url": "https://github.com/",
        "user": "jgr142"
      },
      "linkedin": {
        "title": "Linkedin profile",
        "url": "https://linkedin.com/in/",
        "user": "joshuagisiger"
      }
    }
  },
  "gists": {
    "1": "83861a67e377633ee8368df01ee3a355",
    "2": "694c1f32332788a2ac7f37b09e5aa40e"
  },
  "projects": {
    "1": {
      "id": "owldb",
      "title": "_owldb",
      "description": "A RESTful NoSQL document database in Go featuring JSON schema validation, hierarchical document storage, real-time subscriptions with server-sent events, and basic token-based authentication and atomic operations.",
      "img": "/images/projects/owldb.png",
      "tech": ["GoLang"],
      "made_in_school": true
    },
    "2": {
      "id": "m3ssag1n8",
      "title": "_m3ssag1n8",
      "description": "A real-time, web-based messaging app in TypeScript featuring user login, hierarchical workspaces and channels, rich markdown-style post formatting, emoji reactions, and live updates via server-sent events.",
      "img": "/images/projects/m3ssag1n8.png",
      "tech": ["HTML", "CSS", "JavaScript"],
      "made_in_school": true
    },
    "3": {
      "id": "golem",
      "title": "_golem",
      "description": "An interpreter written fully in golang. Compiler soon to come.",
      "img": "/images/projects/golem.webp",
      "tech": ["GoLang"],
      "made_in_school": true
    },
    "4": {
      "id": "goserve",
      "title": "_goserve",
      "description": "A secure and maintainable snippet-sharing web application in Go, implementing session-based authentication, HTML templating, and MySQL integration",
      "img": "/images/projects/goserve.webp",
      "tech": ["GoLang", "HTML", "CSS"],
      "url": ""
    },
    "5": {
      "id": "feat",
      "title": "_feat",
      "description": "A large-scale Java application that automatically generates concise black-box test suites for Python functions using data-driven analysis of buggy student implementations to support formative and summative feedback in programming education.",
      "img": "/images/projects/feat.webp",
      "tech": ["Java"],
      "made_in_school": true
    },
    "6": {
      "id": "malloc",
      "title": "_malloc",
      "description": "A dynamic memory allocator in C that implements custom versions of malloc, free, and realloc using implicit free lists, first-fit placement, boundary-tag coalescing, and a consistency-checking heap validator.",
      "img": "/images/projects/malloc.webp",
      "tech": ["C"],
      "made_in_school": true
    },
    "7": {
      "id": "shell",
      "title": "_shell",
      "description": "A Unix shell implemented in C that supports job control, foreground and background execution, custom built-in commands (jobs, fg, bg, quit), signal handling (SIGINT, SIGTSTP, SIGCHLD), and process management using fork, execve, and waitpid.",
      "img": "/images/projects/shell.webp",
      "tech": ["C"],
      "made_in_school": true
    },
    "9": {
      "id": "zeno",
      "title": "_zeno",
      "description": "terminal based project helper.",
      "img": "/images/projects/zeno.webp",
      "tech": ["GoLang"],
      "url": "https://github.com/"
    }
  }
}